Revit 2026 API

# Boolean Properties

---

The SpecTypeIdBoolean type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | YesNo | Yes/No, in discipline Common. |

#### Reference

SpecTypeIdBoolean Class

Autodesk.Revit.DB Namespace